Диплом/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом/src/Documents/ВКМ_ОбслуживаниеКлиентов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

 &НаКлиенте
Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	
	Если  Не Объект.Ссылка.Пустая() Тогда 
		//Заполнение таблицы значений 
		Изменения = ИзменениеРеквизитов.Добавить();
		Изменения.Реквизит = Элементы.ДатаПроведенияРабот.Заголовок;
		Изменения.Изменение = Объект.ДатаПроведенияРабот;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	СозданиеЭлементаСправочника();
	
КонецПроцедуры

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	
	Если  Не Объект.Ссылка.Пустая() Тогда 
		Изменения = ИзменениеРеквизитов.Добавить();
		Изменения.Реквизит = Элементы.Специалист.Имя;
		Изменения.Изменение = Объект.Специалист;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаРаботПриИзменении(Элемент) 
	
	Объект.ВремяНачалаРабот = РаботаСоВременем(Объект.ДатаПроведенияРабот,Объект.ВремяНачалаРабот);
	
	Если  Не Объект.Ссылка.Пустая() Тогда 	
		Изменения = ИзменениеРеквизитов.Добавить();
		Изменения.Реквизит = Элементы.ВремяНачалаРабот.Заголовок;
		Изменения.Изменение = Формат(Объект.ВремяНачалаРабот,"ДФ=ЧЧ:мм"); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияРаботПриИзменении(Элемент)
	
	Объект.ВремяОкончанияРабот = РаботаСоВременем(Объект.ДатаПроведенияРабот,Объект.ВремяОкончанияРабот);
	
	Если  Не Объект.Ссылка.Пустая() Тогда 
		Изменения = ИзменениеРеквизитов.Добавить();
		Изменения.Реквизит = Элементы.ВремяОкончанияРабот.Заголовок;
		Изменения.Изменение = Формат(Объект.ВремяОкончанияРабот,"ДФ=ЧЧ:мм");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Функция  РаботаСоВременем(ДатаПроведения,ВремяПроведения)
	
	ДатаВремя = Дата(Год(ДатаПроведения),Месяц(ДатаПроведения),День(ДатаПроведения),
	Час(ВремяПроведения),Минута(ВремяПроведения),Секунда(ВремяПроведения));
	Возврат ДатаВремя;
	
КонецФункции 

&НаСервере
Процедура СозданиеЭлементаСправочника()
	
	ТекстСообщения = "";
	Для Каждого Строка Из ИзменениеРеквизитов Цикл 
		
		СтрокаСообщения = СтрШаблон("Реквизит ""%1"" изменен: %2",
		Строка.Реквизит, Строка.Изменение);
		
		ТекстСообщения = ТекстСообщения + СтрокаСообщения + Символы.ПС;
		
	КонецЦикла;
	
	// Если нужно добавить заголовок в начало
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		ТекстСообщения = "Уведомление об изменениях от " + ТекущаяДата() + " : " + Символы.ПС + ТекстСообщения;
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		
		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграм.СоздатьЭлемент();
		НовыйЭлемент.ТекстСообщения = ТекстСообщения;
		НовыйЭлемент.Записать();
		
		ТекстСообщения = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
